In [10]:
import pandas as pd

In [11]:
l1 = ['crewid', 'fristName', 'position' ]
l2 = [(101, 'frank',5),(102, 'Grace', 3),(103,'mark',2),(104, 'john',3)]

In [13]:
data = pd.DataFrame(columns= l1,data = l2)

In [14]:
data

   crewid fristName  position
0     101     frank         5
1     102     Grace         3
2     103      mark         2
3     104      john         3